Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
prune_low_magnitude_conv2d (Pru (None, 224, 224, 64) 3522        input_1[0][0]                    
__________________________________________________________________________________________________
prune_low_magnitude_batch_norma (None, 224, 224, 64) 257         prune_low_magnitude_conv2d[0][0] 
__________________________________________________________________________________________________
prune_low_magnitude_activation  (None, 224, 224, 64) 1           prune_low_magnitude_batch_normali
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_1 (P (None, 224, 224, 64) 73794       prune_low_magnitude_activation[0]
__________________________________________________________________________________________________
prune_low_magnitude_batch_norma (None, 224, 224, 64) 257         prune_low_magnitude_conv2d_1[0][0
__________________________________________________________________________________________________
prune_low_magnitude_activation_ (None, 224, 224, 64) 1           prune_low_magnitude_batch_normali
__________________________________________________________________________________________________
prune_low_magnitude_max_pooling (None, 112, 112, 64) 1           prune_low_magnitude_activation_1[
__________________________________________________________________________________________________
prune_low_magnitude_dropout (Pr (None, 112, 112, 64) 1           prune_low_magnitude_max_pooling2d
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_2 (P (None, 112, 112, 128 147586      prune_low_magnitude_dropout[0][0]
__________________________________________________________________________________________________
prune_low_magnitude_batch_norma (None, 112, 112, 128 513         prune_low_magnitude_conv2d_2[0][0
__________________________________________________________________________________________________
prune_low_magnitude_activation_ (None, 112, 112, 128 1           prune_low_magnitude_batch_normali
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_3 (P (None, 112, 112, 128 295042      prune_low_magnitude_activation_2[
__________________________________________________________________________________________________
prune_low_magnitude_batch_norma (None, 112, 112, 128 513         prune_low_magnitude_conv2d_3[0][0
__________________________________________________________________________________________________
prune_low_magnitude_activation_ (None, 112, 112, 128 1           prune_low_magnitude_batch_normali
__________________________________________________________________________________________________
prune_low_magnitude_max_pooling (None, 56, 56, 128)  1           prune_low_magnitude_activation_3[
__________________________________________________________________________________________________
prune_low_magnitude_dropout_1 ( (None, 56, 56, 128)  1           prune_low_magnitude_max_pooling2d
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_4 (P (None, 56, 56, 256)  590082      prune_low_magnitude_dropout_1[0][
__________________________________________________________________________________________________
prune_low_magnitude_batch_norma (None, 56, 56, 256)  1025        prune_low_magnitude_conv2d_4[0][0
__________________________________________________________________________________________________
prune_low_magnitude_activation_ (None, 56, 56, 256)  1           prune_low_magnitude_batch_normali
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_5 (P (None, 56, 56, 256)  1179906     prune_low_magnitude_activation_4[
__________________________________________________________________________________________________
prune_low_magnitude_batch_norma (None, 56, 56, 256)  1025        prune_low_magnitude_conv2d_5[0][0
__________________________________________________________________________________________________
prune_low_magnitude_activation_ (None, 56, 56, 256)  1           prune_low_magnitude_batch_normali
__________________________________________________________________________________________________
prune_low_magnitude_max_pooling (None, 28, 28, 256)  1           prune_low_magnitude_activation_5[
__________________________________________________________________________________________________
prune_low_magnitude_dropout_2 ( (None, 28, 28, 256)  1           prune_low_magnitude_max_pooling2d
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_6 (P (None, 28, 28, 512)  2359810     prune_low_magnitude_dropout_2[0][
__________________________________________________________________________________________________
prune_low_magnitude_batch_norma (None, 28, 28, 512)  2049        prune_low_magnitude_conv2d_6[0][0
__________________________________________________________________________________________________
prune_low_magnitude_activation_ (None, 28, 28, 512)  1           prune_low_magnitude_batch_normali
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_7 (P (None, 28, 28, 512)  4719106     prune_low_magnitude_activation_6[
__________________________________________________________________________________________________
prune_low_magnitude_batch_norma (None, 28, 28, 512)  2049        prune_low_magnitude_conv2d_7[0][0
__________________________________________________________________________________________________
prune_low_magnitude_activation_ (None, 28, 28, 512)  1           prune_low_magnitude_batch_normali
__________________________________________________________________________________________________
prune_low_magnitude_max_pooling (None, 14, 14, 512)  1           prune_low_magnitude_activation_7[
__________________________________________________________________________________________________
prune_low_magnitude_dropout_3 ( (None, 14, 14, 512)  1           prune_low_magnitude_max_pooling2d
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_8 (P (None, 14, 14, 1024) 9438210     prune_low_magnitude_dropout_3[0][
__________________________________________________________________________________________________
prune_low_magnitude_batch_norma (None, 14, 14, 1024) 4097        prune_low_magnitude_conv2d_8[0][0
__________________________________________________________________________________________________
prune_low_magnitude_activation_ (None, 14, 14, 1024) 1           prune_low_magnitude_batch_normali
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_9 (P (None, 14, 14, 1024) 18875394    prune_low_magnitude_activation_8[
__________________________________________________________________________________________________
prune_low_magnitude_batch_norma (None, 14, 14, 1024) 4097        prune_low_magnitude_conv2d_9[0][0
__________________________________________________________________________________________________
prune_low_magnitude_activation_ (None, 14, 14, 1024) 1           prune_low_magnitude_batch_normali
__________________________________________________________________________________________________
prune_low_magnitude_dropout_4 ( (None, 14, 14, 1024) 1           prune_low_magnitude_activation_9[
__________________________________________________________________________________________________
prune_low_magnitude_up_sampling (None, 28, 28, 1024) 1           prune_low_magnitude_dropout_4[0][
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_10 ( (None, 28, 28, 512)  4194818     prune_low_magnitude_up_sampling2d
__________________________________________________________________________________________________
prune_low_magnitude_concatenate (None, 28, 28, 1024) 1           prune_low_magnitude_conv2d_10[0][
                                                                 prune_low_magnitude_activation_7[
__________________________________________________________________________________________________
prune_low_magnitude_dropout_5 ( (None, 28, 28, 1024) 1           prune_low_magnitude_concatenate[0
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_11 ( (None, 28, 28, 512)  9437698     prune_low_magnitude_dropout_5[0][
__________________________________________________________________________________________________
prune_low_magnitude_batch_norma (None, 28, 28, 512)  2049        prune_low_magnitude_conv2d_11[0][
__________________________________________________________________________________________________
prune_low_magnitude_activation_ (None, 28, 28, 512)  1           prune_low_magnitude_batch_normali
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_12 ( (None, 28, 28, 512)  4719106     prune_low_magnitude_activation_10
__________________________________________________________________________________________________
prune_low_magnitude_batch_norma (None, 28, 28, 512)  2049        prune_low_magnitude_conv2d_12[0][
__________________________________________________________________________________________________
prune_low_magnitude_activation_ (None, 28, 28, 512)  1           prune_low_magnitude_batch_normali
__________________________________________________________________________________________________
prune_low_magnitude_up_sampling (None, 56, 56, 512)  1           prune_low_magnitude_activation_11
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_13 ( (None, 56, 56, 256)  1048834     prune_low_magnitude_up_sampling2d
__________________________________________________________________________________________________
prune_low_magnitude_concatenate (None, 56, 56, 512)  1           prune_low_magnitude_conv2d_13[0][
                                                                 prune_low_magnitude_activation_5[
__________________________________________________________________________________________________
prune_low_magnitude_dropout_6 ( (None, 56, 56, 512)  1           prune_low_magnitude_concatenate_1
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_14 ( (None, 56, 56, 256)  2359554     prune_low_magnitude_dropout_6[0][
__________________________________________________________________________________________________
prune_low_magnitude_batch_norma (None, 56, 56, 256)  1025        prune_low_magnitude_conv2d_14[0][
__________________________________________________________________________________________________
prune_low_magnitude_activation_ (None, 56, 56, 256)  1           prune_low_magnitude_batch_normali
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_15 ( (None, 56, 56, 256)  1179906     prune_low_magnitude_activation_12
__________________________________________________________________________________________________
prune_low_magnitude_batch_norma (None, 56, 56, 256)  1025        prune_low_magnitude_conv2d_15[0][
__________________________________________________________________________________________________
prune_low_magnitude_activation_ (None, 56, 56, 256)  1           prune_low_magnitude_batch_normali
__________________________________________________________________________________________________
prune_low_magnitude_up_sampling (None, 112, 112, 256 1           prune_low_magnitude_activation_13
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_16 ( (None, 112, 112, 128 262274      prune_low_magnitude_up_sampling2d
__________________________________________________________________________________________________
prune_low_magnitude_concatenate (None, 112, 112, 256 1           prune_low_magnitude_conv2d_16[0][
                                                                 prune_low_magnitude_activation_3[
__________________________________________________________________________________________________
prune_low_magnitude_dropout_7 ( (None, 112, 112, 256 1           prune_low_magnitude_concatenate_2
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_17 ( (None, 112, 112, 128 589954      prune_low_magnitude_dropout_7[0][
__________________________________________________________________________________________________
prune_low_magnitude_batch_norma (None, 112, 112, 128 513         prune_low_magnitude_conv2d_17[0][
__________________________________________________________________________________________________
prune_low_magnitude_activation_ (None, 112, 112, 128 1           prune_low_magnitude_batch_normali
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_18 ( (None, 112, 112, 128 295042      prune_low_magnitude_activation_14
__________________________________________________________________________________________________
prune_low_magnitude_batch_norma (None, 112, 112, 128 513         prune_low_magnitude_conv2d_18[0][
__________________________________________________________________________________________________
prune_low_magnitude_activation_ (None, 112, 112, 128 1           prune_low_magnitude_batch_normali
__________________________________________________________________________________________________
prune_low_magnitude_up_sampling (None, 224, 224, 128 1           prune_low_magnitude_activation_15
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_19 ( (None, 224, 224, 64) 65602       prune_low_magnitude_up_sampling2d
__________________________________________________________________________________________________
prune_low_magnitude_concatenate (None, 224, 224, 128 1           prune_low_magnitude_conv2d_19[0][
                                                                 prune_low_magnitude_activation_1[
__________________________________________________________________________________________________
prune_low_magnitude_dropout_8 ( (None, 224, 224, 128 1           prune_low_magnitude_concatenate_3
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_20 ( (None, 224, 224, 64) 147522      prune_low_magnitude_dropout_8[0][
__________________________________________________________________________________________________
prune_low_magnitude_batch_norma (None, 224, 224, 64) 257         prune_low_magnitude_conv2d_20[0][
__________________________________________________________________________________________________
prune_low_magnitude_activation_ (None, 224, 224, 64) 1           prune_low_magnitude_batch_normali
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_21 ( (None, 224, 224, 64) 73794       prune_low_magnitude_activation_16
__________________________________________________________________________________________________
prune_low_magnitude_batch_norma (None, 224, 224, 64) 257         prune_low_magnitude_conv2d_21[0][
__________________________________________________________________________________________________
prune_low_magnitude_activation_ (None, 224, 224, 64) 1           prune_low_magnitude_batch_normali
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_22 ( (None, 224, 224, 11) 1421        prune_low_magnitude_activation_17
==================================================================================================
Total params: 62,081,586
Trainable params: 31,044,171
Non-trainable params: 31,037,415
